class State
STATES = ['Αττικής','Εύβοιας','Ευρυτανίας','Φωκίδας','Φθιώτιδας','Χαλκιδικής','Ημαθίας','Κιλκίς','Πιερίας','Σερρών','Θεσσαλονίκης','Χανίων','Ηρακλείου','Λασιθίου','Ρεθύμνης','Δράμας','Έβρου','Καβάλας','Ροδόπης','Ξάνθης','Άρτας','Ιωαννίνων','Πρέβεζας','Θεσπρωτίας','Κέρκυρας','Κεφαλληνίας','Λευκάδας','Ζακύνθου','Χίου','Λέσβου','Σάμου','Αρκαδίας','Αργολίδας','Κορινθίας','Λακωνίας','Μεσσηνίας','Κυκλάδων','Δωδεκανήσου','Καρδίτσας','Λάρισας','Μαγνησίας','Τρικάλων','Αχαΐας','Αιτωλοακαρνανίας','Ηλείας','Φλώρινας','Γρεβενών','Καστοριάς','Κοζάνης'] 
 # attr_accessible :title, :body
 def self.filter substring
 	empty=true
 	array=[]
 	STATES.each do |string|
 		if string.mb_chars.downcase.include? substring.mb_chars.downcase
 			then array << string.mb_chars.capitalize
 			empty=false
 		end
 	end
 	if empty
 		return "Δεν υπάρχουν νομοί που να περιέχουν το substring"
 	else
 		return array
 	end
 end
end
